Repository: Come-Mile/Piwigo-Mobile
Catalog: piwigo/Resources/*.lproj/Localizable.strings
Languages: ar

# tabBar_albums
source: Albums
ar: ألبومات

# tabBar_upload
source: Upload
ar: تحميل

# tabBar_preferences
source: Preferences
ar: تفضيلات

# alertOkButton
source: OK
ar: موافق

# alertDismissButton
source: Dismiss
ar: تجاهل

# alertYesButton
source: Yes
ar: نعم

# alertNoButton
source: No
ar: لا

# alertTryAgainButton
source: Try Again
ar: إعادة المحاولة

# alertCancelButton
source: Cancel
ar: إلغاء

# alertAddButton
source: Add
ar: إضافة

# alertRetryButton
source: Retry
ar: إعادة المحاولة

# alertNextButton
source: Next Image
ar: الصورة الموالية

# uploadRights_title
source: Upload Rights Needed
ar: تحميل الحقوق المطلوبة

# uploadRights_message
source: You must have upload rights to be able to upload images or videos.
ar: يجب أن يكون لديك حقوق تحميل ليتمكن من تحميل الصور أو مقاطع الفيديو.

# internetErrorGeneral_title
source: Connection Error
ar: خطأ في الاتصال

# internetErrorGeneral_broken
source: Sorry, the communication was broken. Try logging in again.
ar: عذرا، تم كسر الاتصال. حاول تسجيل الدخول مرة أخرى.

# internetCancellingConnection_button
source: Cancelling Connection…
ar: جاري إلغاء الإتصال…

# internetCancelledConnection_button
source: Cancel Connection
ar: إلغاء الإتصال

# internetCancelledConnection_title
source: Connection Cancelled
ar: تم إلغاء الإتصال

source: Login
ar: تسجيل الدخول

# login_serverPlaceholder
source: Web Address
ar: example.com

# login_userPlaceholder
source: Username (optional)
ar: اسم المستخدم (اختياري)

# login_passwordPlaceholder
source: Password (optional)
ar: كلمة المرور (اختياري)

# login_loggingIn
source: Logging In...
ar: جاري تسجيل الدخول...

# login_connecting
source: Connecting
ar: جاري الإتصال

# login_newSession
source: Opening Session
ar: الجلسة المفتوحة

# login_communityParameters
source: Community Parameters
ar: المعلمات Community

# login_serverParameters
source: Piwigo Parameters
ar: معايير Piwigo

# login_connectionChanged
source: Connection Changed!
ar: تم تغيير الاتصال!

# loginHTTP_title
source: HTTP Credentials
ar: بيانات اعتماد HTTP

# loginHTTP_message
source: Basic access authentification is required by the Piwigo server:
ar: مطلوب مصادقة الوصول الأساسية من قبل خادم Piwigo:

# loginHTTPuser_placeholder
source: Username
ar: اسم المستخدم

# loginHTTPpwd_placeholder
source: Password
ar: كلمة المرور

# serverMethodsError_title
source: Unknown Methods
ar: طرق غير معروفة

# serverMethodsError_message
source: Failed to get server methods. Problem with Piwigo server?
ar: أخفق الحصول على طرق الخادم. مشكلة مع خادم Piwigo ؟

# loginError_title
source: Login Fail
ar: أخفق تسجيل الدخول

# loginError_message
source: The username and password don't match on the given web address
ar: لا يتطابق اسم المستخدم وكلمة المرور مع عنوان الويب المحدد

# loginEmptyServer_title
source: Enter a Web Address
ar: أدخل عنوان ويب

# loginEmptyServer_message
source: Please select a protocol and enter a Piwigo web address in order to proceed.
ar: يرجى تحديد بروتوكول وإدخال عنوان ويب Piwigo للمواصلة.

# serverVersionNotCompatible_title
source: Server Incompatible
ar: الخادم غير متوافق

# serverVersionNotCompatible_message
source: Your Piwigo server version is %@. Piwigo Mobile only supports a version of at least 2.7. Please update your server to use Piwigo Mobile. Do you still want to continue?
ar: إصدار خادم Piwigo هو %@. Piwigo موبايل يدعم فقط على الأقل نسخة من 2.7. يرجى تحديث الخادم الخاص بك لاستخدام Piwigo موبايل. هل ما زلت ترغب في المتابعة؟

# sessionStatusError_title
source: Authentication Fail
ar: فشل أثناء المصادقة

# sessionStatusError_message
source: Failed to authenticate with the server. Try logging in again.
ar: فشل أثناء المصادقة مع الخادم. حاول تسجيل الدخول مرة أخرى.

# serverCommunityError_title
source: Community Error
ar: خطأ في Community

# serverCommunityError_message
source: Failed to get Community extension parameters. Try logging in again.
ar: أخفق الحصول على معلمات إضافة المجتمع. حاول تسجيل الدخول مرة أخرى.

# logoutConfirmation_title
source: Logout
ar: تسجيل خروج

# logoutConfirmation_message
source: Are you sure you want to logout?
ar: هل أنت متأكد من أنك تريد الخروج؟

# logoutFail_title
source: Logout Failed
ar: فشل في تسجيل الخروج

# logoutFail_message
source: Failed to logout. Try again?
ar: أخفق تسجيل الخروج. حاول ثانية؟

# categoryMainEmtpy
source: No albums in your Piwigo yet.You may pull down to refresh or re-login.
ar: لا توجد ألبومات في Piwigo حتى الآن. يمكنك السحب إلى الأسفل لتحديث أو إعادة تسجيل الدخول.

# categoryTableView_photoCount
source: photo
ar: صورة

# categoryTableView_photosCount
source: photos
ar: صور

# categoryTableView_subCategoryCount
source: sub-album
ar: ألبوم فرعي

# categoryTableView_subCategoriesCount
source: sub-albums
ar: ألبومات فرعية

# categoryImageList_selectButton
source: Select
ar: حدد

# categoryImageList_noDataError
source: Error No Data
ar: خطأ لا توجد بيانات

# categorySort_nameAscending
source: Photo Title, A → Z
ar: عنوان الصورة، A → Z

# categorySort_nameDescending
source: Photo Title, Z → A
ar: عنوان الصورة، Z → A

# categorySort_fileNameAscending
source: File Name, A → Z
ar: اسم الملف، A → Z

# categorySort_fileNameDescending
source: File Name, Z → A
ar: اسم الملف، Z → A

# categorySort_dateCreatedDescending
source: Date Created, new → old
ar: تاريخ الإنشاء، جديد → القديم

# categorySort_dateCreatedAscending
source: Date Created, old → new
ar: تاريخ الإنشاء، القديم → جديد

# categorySort_datePostedDescending
source: Date Posted, new → old
ar: تاريخ النشر، جديد → القديم

# categorySort_datePostedAscending
source: Date Posted, old → new
ar: تاريخ النشر، القديم → جديد

# categorySort_videosOnly
source: Videos Only
ar: مقاطع الفيديو فقط

# categorySort_imagesOnly
source: Images Only
ar: الصور فقط

# categoryUpload_chooseAlbum
source: Select an album to upload images to
ar: حدد ألبوما لتحميل الصور إلى

# categoryUpload_chooseLocalAlbum
source: Select an album to get images from
ar: حدد ألبوما للحصول على صور من

# categoyUpload_loadSubCategories
source: load
ar: تحميل

# createNewAlbum_title
source: New Album
ar: البوم جديد

# createNewAlbum_message
source: Enter a name for this album:
ar: أدخل اسم لهذا الألبوم:

# createNewAlbum_placeholder
source: Album Name
ar: اسم الألبوم

# createNewAlbumHUD_label
source: Creating Album…
ar: جار إنشاء الألبوم…

# createAlbumError_title
source: Create Album Error
ar: خطأ في إنشاء ألبوم

# createAlbumError_message
source: Failed to create a new album
ar: فشل إنشاء ألبوم جديد

# categoryCellOption_rename
source: Rename
ar: إعادة التسمية

# categoryCellOption_move
source: Move
ar: نقل

# categoryCellOption_delete
source: Delete
ar: حذف

# renameCategory_title
source: Rename Album
ar: إعادة تسمية الألبوم

# renameCategory_message
source: Enter a new name for this album
ar: أدخل اسم جديد لهذا الألبوم

# renameCategory_button
source: Rename
ar: إعادة التسمية

# renameCategoryHUD_label
source: Renaming Album…
ar: جار إعادة تسمية الألبوم…

# renameCategoyError_title
source: Rename Fail
ar: فشلت إعادة التسمية

# renameCategoyError_message
source: Failed to rename your album
ar: فشل إعادة تسمية الألبوم الخاص بك

# deleteCategory_title
source: DELETE ALBUM
ar: حذف الألبوم

# deleteCategory_message
source: ARE YOU SURE YOU WANT TO DELETE THE ALBUM "%@" AND ALL %@ IMAGES?
ar: هل أنت متأكد من رغبتك في حذف الألبوم "%@" وجميع %@ من الصور؟

# deleteCategoryConfirm_title
source: Are you sure?
ar: هل أنت واثق؟

# deleteCategoryConfirm_message
source: Please enter the number of images in order to delete this album. Number of images: %@
ar: الرجاء إدخال عدد الصور لحذف هذا الألبوم. عدد الصور: %@

# deleteCategoryConfirm_deleteButton
source: DELETE
ar: حذف

# deleteCategoryHUD_label
source: Deleting Album…
ar: جار حذف الألبوم…

# deleteCategoryMatchError_title
source: Number Doesn't Match
ar: الرقم لا يطابق

# deleteCategoryMatchError_message
source: The number of images you entered doesn't match the number of images in the category. Please try again if you desire to delete this album
ar: لا يتطابق عدد الصور التي أدخلتها مع عدد الصور في الفئة. الرجاء إعادة المحاولة إذا كنت ترغب في حذف هذا الألبوم

# deleteCategoryError_title
source: Delete Fail
ar: فشل في حذف

# deleteCategoryError_message
source: Failed to delete your album
ar: فشل في حذف الألبوم الخاص بك

# moveCategory
source: Move Album
ar: نقل الألبوم

# moveCategory_selectParent
source: Select an album to move album "%@" into
ar: حدد ألبوما لنقل الألبوم "%@" إلى

# moveCategory_message
source: Are you sure you want to move "%@" into the album "%@"?
ar: هل تريد بالتأكيد نقل "%@" إلى الألبوم "%@"؟

# moveCategoryHUD_moving
source: Moving Album…
ar: جار نقل الألبوم…

# moveCategoryError_title
source: Move Fail
ar: فشل النقل

# moveCategoryError_message
source: Failed to move your album
ar: فشل في نقل الألبوم الخاص بك

# categoryImageSet_title
source: Set Image Thumbnail
ar: Album Thumbnail

# categoryImageSet_message
source: Are you sure you want to set this image for the album "%@"?
ar: هل تريد بالتأكيد تعيين هذه الصورة للألبوم "%@"؟

# categoryImageSetHUD_updating
source: Updating Album Thumbnail…
ar: جار تحديث الصورة المصغرة للألبوم…

# categoryImageSetError_title
source: Image Set Error
ar: خطأ في تعيين الصورة

# categoryImageSetError_message
source: Failed to set the album image
ar: أخفق تعيين صورة الألبوم

# singleImage
source: Image
ar: صورة

# severalImages
source: Images
ar: الصور

source: No Images
ar: لا توجد صور

# pullToRefresh
source: Reload Images
ar: إعادة تحميل الصور

# albumPhotoError_title
source: Get Album Photos Error
ar: احصل على خطأ صور الألبوم

# albumPhotoError_message
source: Failed to get album photos (corrupt image in your album?)
ar: تعذر الحصول على صور الألبوم (صورة تالفة في ألبومك؟)

source: Sort by
ar: التصنيف حسب

# imageSortTitle
source: Sort Images
ar: فرز الصور

# imageSortMessage
source: Please select how you wish to sort images
ar: الرجاء تحديد الطريقة التي ترغب في فرز الصور بها

# imageOptions_title
source: Image Options
ar: خيارات الصورة

# imageOptions_edit
source: Edit
ar: تعديل

# imageOptions_download
source: Download
ar: تنزيل

# imageOptions_setAlbumImage
source: Set as Album Image
ar: تعيين كصورة الألبوم

# imageDetailsView_title
source: Image Details
ar: تفاصيل الصورة

# editImageDetails_title
source: Title:
ar: العنوان:

# editImageDetails_titlePlaceholder
source: Title
ar: العنوان

# editImageDetails_author
source: Author:
ar: المؤلف:

# editImageDetails_tags
source: Tags:
ar: العلامات:

# editImageDetails_privacyLevel
source: Who can see this photo?
ar: من يمكنه مشاهدة هذه الصورة؟

# editImageDetails_descriptionPlaceholder
source: Description
ar: الوصف

# editImageDetailsHUD_updating
source: Updating Image Info…
ar: جار تحديث معلومات الصورة…

# editImageDetailsError_title
source: Failed to Update
ar: فشل في التحديث

# editImageDetailsError_message
source: Failed to update your changes with your server. Try again?
ar: فشل في تحديث التغييرات مع الخادم. حاول ثانية؟

# imageDetailsFetchError_title
source: Image Details Fetch Failed
ar: أخفق جلب تفاصيل الصورة

# imageDetailsFetchError_retryMessage
source: Fetching the image data failed. Try again?
ar: أخفق جلب بيانات الصورة. حاول مرة أخرى؟

# imageDetailsFetchError_continueMessage
source: Fetching the image data failed. Continue?
ar: أخفق جلب بيانات الصورة. استمر؟

source: Privacy Level
ar: مستوى الخصوصية

# privacyLevel_admin
source: Admins
ar: المشرفين

# privacyLevel_adminFamily
source: Admins, Family
ar: المشرفين، العائلة

# privacyLevel_adminsFamilyFriends
source: Admins, Family, Friends
ar: المشرفين، العائلة، الأصدقاء

# privacyLevel_adminsFamilyFriendsContacts
source: Admins, Family, Friends, Contacts
ar: المشرفين، العائلة، الأصدقاء، جهات الاتصال

# privacyLevel_everybody
source: Everybody
ar: الجميع

source: none
ar: لا شيء

source: Tags
ar: العلامات

# tagsHeader_selected
source: Selected
ar: تم تحديدها

# tagsHeader_all
source: All
ar: الكل

# selectAll
source: All
ar: الكل

# deleteImage_delete
source: Delete
ar: حذف

# deleteImageProgress_title
source: Deleting %@%% Done
ar: تم حذف %@%%

# deleteSingleImage_title
source: Delete Image
ar: حذف الصورة

# deleteSingleImage_message
source: Are you sure you want to delete this image? This cannot be undone!
ar: هل أنت متأكد أنك تريد حذف هذه الصورة؟ هذا لا يمكن التراجع عنه!

# deleteSeveralImages_title
source: Delete Images
ar: حذف الصور

# deleteSeveralImages_message
source: Are you sure you want to delete the selected %@ images? This cannot be undone!
ar: هل تريد بالتأكيد حذف %@ من الصور المحددة؟ هذا لا يمكن التراجع عنه!

# deleteImageFail_title
source: Delete Failed
ar: فشل الحذف

# deleteImageFail_message
source: Image could not be deleted %@
ar: تعذر حذف الصورة %@

# downloadSingleImage_title
source: Download Image
ar: تحميل الصورة

# downloadSingleImage_confirmation
source: Are you sure you want to download the selected image?
ar: هل تريد بالتأكيد تنزيل الصورة المحددة؟

# downloadSeveralImages_title
source: Download Images
ar: تحميل الصور

# downloadSeveralImage_confirmation
source: Are you sure you want to download the selected %@ images?
ar: هل تريد بالتأكيد تنزيل %@ من الصور المحددة؟

source: Downloading Image
ar: تنزيل الصورة

source: Downloading Images
ar: تنزيل الصور

source: Downloading Image Info
ar: تنزيل معلومات الصورة

source: Downloading Image Info for Sort
ar: تحميل معلومات الصورة للفرز

# downloadImageFail_title
source: Download Fail
ar: أخفق التنزيل

# downloadImageFail_message
source: Failed to download image! %@
ar: أخفق تنزيل الصورة! %@

# downloadVideoFail_message
source: Failed to download video! %@
ar: أخفق تنزيل الفيديو! %@

# downloadVideoFail_Photos
source: Video format not accepted by Photos!
ar: تنسيق الفيديو غير مقبول من قبل الصور!

# imageSaveError_title
source: Fail Saving Image
ar: أخفق حفظ الصورة

# imageSaveError_message
source: Failed to save image. Error: %@
ar: أخفق حفظ الصورة. خطأ:%@

# videoSaveError_title
source: Fail Saving Video
ar: أخفق حفظ الفيديو

# videoSaveError_message
source: Failed to save video. Error: %@
ar: أخفق حفظ الفيديو. خطأ:%@

# imageUploadDetails_title
source: Title:
ar: العنوان:

# imageUploadDetails_author
source: Author:
ar: الكاتب:

# imageUploadDetails_privacy
source: Privacy:
ar: الخصوصية:

# imageUploadDetails_tags
source: Tags:
ar: العلامات:

# imageUploadDetails_description
source: Description:
ar: الوصف:

# imageUploadDetailsView_title
source: Images
ar: الصور

# imageUploadDetailsButton_title
source: Upload
ar: تحميل

# imageUploadDetailsEdit_title
source: Edit Images to Upload
ar: تعديل الصور للتحميل

# imageUploadDetailsUploading_title
source: Images that are Being Uploaded
ar: الصور التي يتم تحميلها

# imageUploadDetailsCell_uploadComplete
source: Completed! Finishing up...
ar: اكتملت! جار الانتهاء...

# imageUploadTableCell_uploading
source: Uploading...
ar: تحميل...

# imageUploadProgressBar_zero
source: Uploading 0/0
ar: جار التحميل 0/0

# imageUploadProgressBar_nonZero
source: Uploading %@/%@
ar: جار التحميل %@/%@

# imageUploadProgressBar_completed
source: Completed
ar: اكتملت

# imageUploadCompleted_title
source: Upload Completed
ar: اكتمل التحميل

# imageUploadCompleted_message
source: image/video uploaded to your Piwigo server.
ar: صورة / فيديو تم تحميلها إلى خادم Piwigo الخاص بك.

# imageUploadCompleted_message>1
source: images/videos uploaded to your Piwigo server.
ar: صور / فيديوهات تم تحميلها إلى خادم Piwigo الخاص بك.

# uploadError_title
source: Upload Error
ar: خطأ في التحميل

# uploadError_message
source: Could not upload your image. Error: %@
ar: تعذر تحميل الصورة الخاصة بك. خطأ: %@

# uploadCancelled_title
source: Upload Cancelled
ar: تم إلغاء الرفع

# imageUploadError_title
source: Image Upload Error
ar: خطأ في تحميل الصورة

# imageUploadError_format
source: Sorry, image files with extensions .%@ and .jpg are not accepted by the Piwigo server.
ar: عذرا، لا يتم قبول ملفات الصور ذات الإضافات.%@ و .jpg بواسطة خادم Piwigo.

# imageUploadError_source
source: cannot create image source
ar: لا يمكن إنشاء مصدر الصورة

# imageUploadError_destination
source: cannot create image destination
ar: لا يمكن إنشاء وجهة الصورة

# imageUploadError_iCloud
source: Could not retrieve image from iCloud. Error: %@
ar: تعذر استرداد الصورة من iCloud. خطأ:%@

# audioUploadError_title
source: Audio Upload Error
ar: خطأ في تحميل الصوت

# audioUploadError_format
source: Sorry, audio files are not supported by Piwigo Mobile yet.
ar: عذرا، لا يتم اعتماد الملفات الصوتية من قبل Piwigo موبايل حتى الآن.

# videoUploadError_title
source: Video Upload Error
ar: خطأ في تحميل الفيديو

# videoUploadError_format
source: Sorry, video files with extension .%@ are not accepted by the Piwigo server.
ar: عذرا، لا يتم قبول ملفات الفيديو التي تحتوي على إضافة .%@ بواسطة خادم Piwigo.

# videoUploadError_iCloud
source: Could not retrieve video from iCloud. Error: %@
ar: تعذر استرداد الفيديو من iCloud. خطأ:%@

# videoUploadError_export
source: Sorry, the video could not be retrieved for the upload. Error: %@
ar: عذرا، تعذر استرداد الفيديوليتم تحميله. خطأ:%@

# videoUploadError_unknown
source: Sorry, the upload of the video has failed for an unknown error during the MP4 conversion. Error: %@
ar: عذرا، أخفق تحميل الفيديو بسبب خطأ غير معروف أثناء عملية التحويل MP4. خطأ:%@

# videoUploadCancelled_message
source: The upload of the video has been cancelled.
ar: تم إلغاء تحميل الفيديو.

source: Local Albums
ar: Photo Library

# localImageSort_newest
source: Newest
ar: الأحدث

# localImageSort_oldest
source: Oldest
ar: الأقدم

# localImageSort_notUploaded
source: Not Uploaded
ar: لم يتم تحميلها

# localImageSort_undefined
source: Undefined
ar: غير محدد

# localAlbums_photosNotAuthorized_title
source: No Access
ar: ممنوع الدخول

# localAlbums_photosNiltitle
source: Problem Reading Photos
ar: مشكلة في قراءة الصور

# localAlbums_photosNnil_msg
source: There is a problem reading your local photo library.
ar: هناك مشكلة في قراءة مكتبة الصور المحلية.

# localAlbums_photosNotAuthorized_msg
source: Cannot open local photo library. Please go into the Settings app, Privacy, Photos and enable access for Piwigo.
ar: لا يمكن فتح مكتبة الصور المحلية. يرجى الدخول إلى إعدادات التطبيق، وتمكين الوصول ل Piwigo.

# settingsHeader_server
source: Piwigo Server
ar: خادم Piwigo

# settings_server
source: Address
ar: العنوان

# settings_username
source: Username
ar: اسم المستخدم

# settings_notLoggedIn
source: - Not Logged In -
ar: - لم تقم بتسجيل الدخول -

# settings_logout
source: Logout
ar: الخروج

# settingsFooter_formats
source: The server accepts the following file types
ar: يقبل الخادم أنواع الملفات التالية

# settingsHeader_general
source: General Settings
ar: الاعدادات العامة

# settings_loadAllCategories
source: Download all Albums at Start
ar: تحميل جميع الألبومات في البداية

# settings_loadAllCategories>320px
source: Download all Albums at Start (uncheck if troubles)
ar: تحميل جميع الألبومات في البداية (إلغاء التحديد إذا تعذرت)

# defaultImageSort
source: Sort
ar: التصنيف

# defaultImageSort>320px
source: Default Sort
ar: النوع الافتراضي

# defaultImageSort>414px
source: Default Sort of Images
ar: الفرز الافتراضي للصور

# defaultThumbnailSize
source: Thumbnails
ar: ‮الحجم

# defaultThumbnailSize>320px
source: Thumbnails Size
ar: حجم الصور المصغرة

# defaultThumbnailSize>414px
source: Default Size of Thumbnails
ar: الحجم الافتراضي للصور المصغرة

# defaultThumbnailSizeHeader
source: Please Select a Thumbnail Size
ar: Please select a thumbnail image size

# settings_displayTitles
source: Titles on Thumbnails
ar: العناوين على الصور المصغرة

# settings_displayTitles>320px
source: Display Titles on Thumbnails
ar: عرض العناوين على الصور المصغرة

# thumbnailSizeSquare
source: Square
ar: مربع

# thumbnailSizeThumbnail
source: Thumbnail
ar: الصورة المصغرة

# thumbnailSizeXXSmall
source: Tiny
ar: صغير

# thumbnailSizeXSmall
source: Extra Small
ar: صغير جدا

# thumbnailSizeSmall
source: Small
ar: صغير

# thumbnailSizeMedium
source: Medium
ar: متوسط

# thumbnailSizeLarge
source: Large
ar: كبير

# thumbnailSizeXLarge
source: Extra Large
ar: كبير جدا

# thumbnailSizeXXLarge
source: Huge
ar: ضخم

# thumbnailSizexFullRes
source: Full Resolution
ar: عرض كامل

# defaultImageSize
source: Images
ar: الصور

# defaultImageSize>320px
source: Images Size
ar: حجم الصورة

# defaultImageSize>414px
source: Default Size of Images
ar: الحجم الافتراضي للصور

# defaultImageSizeHeader
source: Please Select an Image Size
ar: الرجاء تحديد حجم الصورة

# defaultImageSize_recommended
source: (recommended)
ar: (موصى به)

# defaultSize_disabled
source: (disabled on server)
ar: (معطل على الخادم)

# defaultSizeFooter
source: Greyed sizes are not advised or not available on Piwigo server.
ar: لا ينصح بأحجام الرمادي أو إنها غير متوفرة على خادم Piwigo.

# imageSizeSquare
source: Square
ar: مربع

# imageSizeThumbnail
source: Thumbnail
ar: الصورة المصغرة

# imageSizeXXSmall
source: Tiny
ar: صغير

# imageSizeXSmall
source: Extra Small
ar: صغير جدا

# imageSizeSmall
source: Small
ar: صغير

# imageSizeMedium
source: Medium
ar: متوسط

# imageSizeLarge
source: Large
ar: كبير

# imageSizeXLarge
source: Extra Large
ar: كبير جدًا

# imageSizeXXLarge
source: Huge
ar: ضخم

# imageSizexFullRes
source: Full Resolution
ar: عرض كامل

# settingsHeader_upload
source: Default Upload Settings
ar: إعدادات التحميل الافتراضية

# settings_defaultAuthor
source: Author
ar: الكاتب

# settings_defaultAuthor>320px
source: Author Name
ar: اسم الكاتب

# settings_defaultAuthorPlaceholder
source: Author Name
ar: اسم الكاتب

# settings_defaultPrivacy
source: Privacy
ar: الخصوصية

# settings_defaultPrivacy>414px
source: Who Can See the Media?
ar: Please select who will be able to see images

# settings_stripGPSdata
source: Strip Private Metadata
ar: قطاع البيانات الوصفية الخاصة

# settings_stripGPSdata>375px
source: Strip Private Metadata Before Upload
ar: جرد البيانات الوصفية الخاصة قبل التحميل

# settings_photoResize
source: Resize Before Upload
ar: تغيير الحجم قبل التحميل

# settings_photoResize>375px
source: Resize Image Before Upload
ar: تغيير حجم الصورة قبل التحميل

# settings_photoSize
source: > Size
ar: > الحجم

# settings_placeholderSize
source: Enter a Photo Size from 5 - 100
ar: أدخل حجم الصورة من 5 - 100

# settings_photoCompress
source: Compress Before Upload
ar: التضغيط قبل التحميل

# settings_photoCompress>375px
source: Compress Image Before Upload
ar: ضغط الصورة قبل التحميل

# settings_photoQuality
source: > Quality
ar: > الجودة

# settings_placeholderQuality
source: Enter an Image Quality from 50 - 98
ar: أدخل جودة الصورة من 50 - 98

# settings_deleteImage>375px
source: Delete Image After Upload
ar: حذف الصورة بعد تحميل

# settings_deleteImage
source: Delete After Upload
ar: الحذف بعد التحميل

# settingsHeader_cache
source: Cache Settings (Used/Total)
ar: ذاكرة الإعدادات المؤقة (المستخدم / الإجمالي)

# settings_cacheDisk
source: Disk
ar: القرص

# settings_cacheMemory
source: Memory
ar: الذاكرة

# settingsHeader_colors
source: Colors
ar: الألوان

# settings_darkPalette
source: Dark Palette
ar: اللوحة المظلمة

# settings_switchPalette
source: Switch Automatically
ar: التبديل تلقائيا

# settings_brightness
source: Brightness
ar: السطوع

# settings_appName
source: Piwigo Mobile
ar: Piwigo موبايل

# settingsHeader_about
source: Information
ar: معلومة

# settings_supportForum
source: Support Forum
ar: منتدى الدعم

# settings_releaseNotes
source: Release Notes
ar: ملاحظات الإصدار

# settings_rateInAppStore
source: Rate Piwigo Mobile
ar: تقييم Piwigo موبايل

# settings_translateWithCrowdin
source: Translate Piwigo Mobile
ar: ترجمة Piwigo موبايل

# settings_acknowledgements
source: Acknowledgements
ar: شكر وتقدير
