Repository: Come-Mile/Piwigo-Mobile
Catalog: piwigo/Resources/*.lproj/ReleaseNotes.strings
Languages: ar

# v2.1.5_text
source: Version 2.1.5 • Image file format now preserved after resize • Fix metadata partly lost upon download • Code modernization • Bug fixes ________________________________________
ar: الإصدار 2.1.5 21 ديسمبر 2017 • إضافة إمكانية إلغاء التحميلات • إضافة خيار لحذف الصور بعد التحميل • إضافة التوافق مع تحسين التخزين (iCloud) • الحفاظ على تنسيق الصورة بعد تغيير حجم كلما كان ذلك ممكنا • الترجمات الدانماركية والإندونيسية • إصلاح البيانات الوصفية فقدت جزئيا عند التنزيل • إصلاح تنسيق ينغ استبدال جبيغ قبل التحميل • إصلاح القضايا التي تواجهها مع دائرة الرقابة الداخلية 11 و إفون X • إصلاح الأخطاء الطفيفة • تحديث الرمز

# v2.1.4_text
source: Version 2.1.4 October 31, 2017 • Swedish translation • Bug fixes ________________________________________
ar: الإصدار 2.1.4 31 أكتوبر 2017 • الترجمة السويدية • اصلاحات الشوائب

# v2.1.3_text
source: Version 2.1.3 October 19, 2017 • Add basic access authentication • Allow cancelling auto-connection • Improve interface and upload management • Improve translations and iOS 11 compatibility • Fix bug encountered with "Not uploaded" filter • Code modernization ________________________________________
ar: الإصدار 2.1.3 19 أكتوبر، 2017 • إضافة مصادقة الوصول الأساسية • السماح بإلغاء الاتصال التلقائي • تحسين واجهة وتحميل الإدارة • تحسين الترجمة ودائرة الرقابة الداخلية 11 التوافق • إصلاح علة واجه مع المرشح "لم يتم تحميل" • تحديث الرمز

# v2.1.2_text
source: Version 2.1.2 September 7, 2017 • Fix refused login with Community plugin versions <2.9 • Improve translations • Maintenance work ________________________________________
ar: الإصدار 2.1.2 7 سبتمبر 2017 • إصلاح رفض تسجيل الدخول مع الإصدارات المساعد المجتمع <2.9 • تحسين الترجمة • أعمال صيانة

# v2.1.1_text
source: Version 2.1.1 August 20, 2017 • Fix bug encountered with non-valid SSL certificates • Improve Danish translation ________________________________________
ar: الإصدار 2.1.1 20 أغسطس 2017 • إصلاح الأخطاء التي واجهتها مع شهادات سل غير صالحة • تحسين الترجمة الدنماركية

# v2.1.0_text
source: Version 2.1 August 14, 2017 • Community extension compatibility • Danish, French, Polish translations • Bug fixes ________________________________________
ar: الإصدار 2.1 14 أغسطس 2017 • التوافق الإرشاد المجتمع • الترجمات الدانماركية والفرنسية والبولندية • اصلاحات الشوائب

# v2.0.4_text
source: Version 2.0.4 July 28, 2017 • iPad — Fix fuzzy thumbnails and the impossibility to edit photos on iPad • Videos — Fix upload and download issues (VideoJS extension required on server) • Settings — Add options to remove titles & change thumbnails resolution • Improve connection reliability and inform when upload completed • Minor bug fixes and improvement of the interface ________________________________________
ar: الإصدار 2.0.4 28 يوليو 2017 • باد - إصلاح الصور المصغرة غامض واستحالة تحرير الصور على باد • فيديو - إصلاح تحميل وتحميل القضايا (فيدوجس التمديد المطلوبة على الخادم) • إعدادات - إضافة خيارات لإزالة العناوين وتغيير الصور المصغرة القرار • تحسين موثوقية الاتصال وإعلام عند اكتمال التحميل • إصلاحات الشوائب طفيفة وتحسين واجهة

# v2.0.3_text
source: Version 2.0.3 May 26, 2017 • Add option to strip GPS metadata in Settings page • Add current cache usage in Settings page • Fix cache settings sometimes forgotten/reset • Fix upload image settings sometimes lost/reset ________________________________________
ar: الإصدار 2.0.3 26 مايو 2017 • إضافة خيار لتجريد البيانات الوصفية غس في صفحة إعدادات • إضافة استخدام ذاكرة التخزين المؤقت الحالي في صفحة إعدادات • إصلاح إعدادات ذاكرة التخزين المؤقت في بعض الأحيان نسي / إعادة تعيين • إصلاح تحميل إعدادات الصورة في بعض الأحيان فقدت / إعادة تعيين

# v2.0.2_text
source: Version 2.0.2 May 8, 2017 • Sort criteria now identical to those of the Web app • Fix sort issues • Fix a crash encountered when adding tags to a photo before upload • Fix situations where the deletion of a selection of images did not work • Fix situations where an album did not show up after move • Fix a compatibility issue with iOS 10 — deprecated code ________________________________________
ar: الإصدار 2.0.2 8 مايو 2017 • معايير التصنيف مطابقة الآن لتلك التي من التطبيق على شبكة الإنترنت • إصلاح قضايا الفرز • إصلاح تحطم واجهت عند إضافة علامات إلى صورة قبل التحميل • إصلاح الحالات حيث حذف مجموعة مختارة من الصور لم تنجح • إصلاح الحالات حيث ألبوم لم تظهر بعد التحرك • إصلاح مشكلة التوافق مع دائرة الرقابة الداخلية 10 - رمز موقوف

# v2.0.1_text
source: Version 2.0.1 June 26, 2015 New settings: - Option to resize images upon upload + Image quality is from a range of 50 - 98% - Ability to set a default image preview size Bug fixes ________________________________________
ar: الإصدار 2.0.1 26 حزيران (يونيو) 2015 إعدادات جديدة: - الخيار لتغيير حجم الصور عند التحميل + جودة الصورة هي من مجموعة من 50 - 98٪ - القدرة على تعيين الافتراضي حجم معاينة الصورة اصلاحات الشوائب

# v2.0.0_text
source: Version 2.0 April 24, 2015 New native application featuring: - Ability to manage albums - View your images - Bulk image upload - Video upload and playback (VideoJS plugin must be installed) ________________________________________
ar: الإصدار 2.0 24 نيسان (أبريل) 2015 تطبيق الأصلي الجديد يضم: - القدرة على إدارة الألبومات - عرض الصور الخاصة بك - تحميل الصورة السائبة - تحميل الفيديو وتشغيل (يجب تثبيت فيدوجس البرنامج المساعد)

# v1.0.0_text
source: Version 1.0 October 17, 2011
ar: الإصدار 1.0 17 أكتوبر 2011
